Tekla Open API Reference for Tekla Structures 2025
RebarItem.HookRadius135Degrees Property
 The rebar item's hook radius for 135 degrees.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double HookRadius135Degrees { get; set; }
Public Property HookRadius135Degrees As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace